# Уровень 1

# Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно
# из чисел: 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны).

def check_congruence(x: float, y: float, z: float):
    ...
    # ваш код
    

# Уровень 2

# Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски,
# определите, может ли ладья попасть с первой клетки на вторую одним ходом.
# Входные данные:
# Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки
# сначала для первой клетки, потом для второй клетки.
# Выходные данные:
# Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в
# противном случае.

def check_rook_move(a: int, b: int, c: int, d: int):
    ...
    # ваш код

# Уровень 3

# Пусть пользователь придумывает пароль и вводит его с клавиатуры. Допустимым считается пароль,
# который состоит более чем из 8 символов и включает как прописные, так и заглавные буквы. Используя
# цикл while дождитесь, пока пользователь введет допустимый пароль.
# Длину строки можно считать с помощью функции len().

while:
    ...
    # ваш код
    
    
